fio/basic.output
naspberry@raspberrypi:/tmp/fio-test $ fio --name=pi-storage-test     --directory=/tmp/fio-test     --rw=randrw     --rwmixread=70     --bs=4k     --size=100M     --numjobs=4     --runtime=60     --time_based     --group_reporting
pi-storage-test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
pi-storage-test: Laying out IO file (1 file / 100MiB)
pi-storage-test: Laying out IO file (1 file / 100MiB)
pi-storage-test: Laying out IO file (1 file / 100MiB)
[...]
Jobs: 4 (f=4): [m(4)][66.3%][eta 00m:33s]
pi-storage-test: (groupid=0, jobs=4): err= 0: pid=2334: Sun Jun  8 18:58:02 2025
  read: IOPS=730, BW=2923KiB/s (2993kB/s)(184MiB/64390msec)
    clat (usec): min=1216, max=1804.9k, avg=4097.84, stdev=26211.64
     lat (usec): min=1219, max=1804.9k, avg=4098.70, stdev=26211.68
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[   41], 99.50th=[   94], 99.90th=[  146], 99.95th=[  159],
     | 99.99th=[ 1502]
   bw (  KiB/s): min=   32, max= 5896, per=100.00%, avg=4030.87, stdev=638.12, samples=373
   iops        : min=    8, max= 1474, avg=1006.65, stdev=159.68, samples=373
  write: IOPS=317, BW=1269KiB/s (1299kB/s)(79.8MiB/64390msec); 0 zone resets
    clat (usec): min=10, max=6030.1k, avg=3133.79, stdev=127974.94
     lat (usec): min=10, max=6030.1k, avg=3135.00, stdev=127974.98
    clat percentiles (usec):
     |  1.00th=[     12],  5.00th=[     16], 10.00th=[     19],
     | 20.00th=[     21], 30.00th=[     28], 40.00th=[     39],
     | 50.00th=[     46], 60.00th=[     51], 70.00th=[     56],
     | 80.00th=[     62], 90.00th=[     70], 95.00th=[     78],
     | 99.00th=[    113], 99.50th=[    126], 99.90th=[   7898],
     | 99.95th=[4395631], 99.99th=[5939135]
   bw (  KiB/s): min=   28, max= 3412, per=100.00%, avg=1922.85, stdev=263.70, samples=339
   iops        : min=    4, max=  852, avg=479.10, stdev=66.01, samples=339
  lat (usec)   : 20=4.97%, 50=13.03%, 100=11.77%, 250=0.44%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=68.92%, 10=0.11%, 20=0.01%, 50=0.03%
  lat (msec)   : 100=0.33%, 250=0.31%, 500=0.01%, 2000=0.02%, >=2000=0.02%
  cpu          : usr=0.45%, sys=1.48%, ctx=47788, majf=0, minf=122
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=47058,20424,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2923KiB/s (2993kB/s), 2923KiB/s-2923KiB/s (2993kB/s-2993kB/s), io=184MiB (193MB), run=64390-64390msec
  WRITE: bw=1269KiB/s (1299kB/s), 1269KiB/s-1269KiB/s (1299kB/s-1299kB/s), io=79.8MiB (83.7MB), run=64390-64390msec

Disk stats (read/write):
  mmcblk0: ios=47058/4012, merge=0/10, ticks=182003/3786896, in_queue=3968900, util=92.92%